load-test.yml
config:
  target: "https://campus-ride-backend.up.railway.app"
  phases:
    - duration: 60
      arrivalRate: 10
      name: Sustained Baseline Phase
    - duration: 120
      arrivalRate: 50
      name: Heavy Scaling Stress Spike Phase
scenarios:
  - flow:
      - get:
          url: "/api/v1/students/"